# coding: utf-8
#これからRubyで何かをやりたい　初級の方の最初のコードはこんな感じでいいですよ。

#支援メンター：a)実験君　b)説明さん　c)スパーコミッター　d)ぶちょー
#開発チームで協力して目標を達成していきます。緊張感は　たれぱんだ　並み
#必要そうなときに、必要そうなものを用意して進言を的確にしようというルールです。

#ふちょー)　みんなおはよう　だれかいるかな　熱いなぁ　溶けちゃいそうだよ
#b)ｆさんは夜勤明けで今寝てます。
#b)溶けちゃうって　ぶちょーはマシュマロかかき氷なんですか？

#a)b)さんは化学的な実は違うことをたまに言いますが気にしないでください。
#初心者さん　・・・・・・・・　はい。

#ぶちょー）陳武は人じゃないよ

#初心者さん　今からやりたいことをざっくり書きます

#a)なるほどそういうことをやりたいのですね
#a)昔品質テストと性能を測ったことがあってその時のグラフがこうです。
#a)文字検出は自然言語処理技術と言われていて説明すると2週間かかります。
#a)そういうことをやるときはそのバージョンの場合この書き方がいいです。
#a)このファイルだけで言うと正規表現を用いるといいでしょう。

#a)こんな感じで値が取れます。わかりますか？

#初心者さん　いえさっぱり　わかりません
#a)わかりにくいと思います。実はやりたいことに対して、答えが1パターンしかなく
#中級の人に書いてもらうといいかもしれないですね。どうするとうまく行くかすでに知っているかも

#初心者さん　そうなんですね　とりあえずそれっぽうく書いてみたのですが、なんかエラーで止まりますが？

#b)あ、それはバグです。特定のOSとライブラリの組み合わせで相性で落ちる既知バグ
#b)私達が修正できないところではらんだ不具合です。対策しないとデータが破損してしまうようです。
#b)私は細かいとこまで、追いかけるのが得意で、ダメなケースがざっくり2秒でわかります。

#b)別の手段を探しますか？
#c)後で特別パッチを書いときます。

#d)ぶちょー　んー　そういうことがあったか　これ人件費：承認

#　©

class MyRegex
  @@cnt = 0
  def initialize()
  #def initialize(counter_name)
    @@cnt+=1
  end
  def name
    @name
  end
 
  def name=(name)
    @name = name
  end
  
  def self.get_cnt
    @@cnt
  end
  
  #これからやること

  #まず、文字コードはなんですか？
  
  #指定のファイルを読む
  
  #特定のパターンがあるか調査
  #そのデータの中に

  #特定のパターンがあるか調査

  #E-MAILアドレスある？

  #電話番号ある？

  #郵便番号ある？

  #LINKある？

  #日付ある？

  #タグある？

  #予約キーワードある？

  #時刻ある？

  #日程ある？

  #お金（日本円数字)ある？

  #通貨の単位と数字はなあに？ユーロ？
  
end
