# coding: utf-8
class MyRegex
  def name
    @name
  end
 
  def name=(name)
    @name = name
  end
  #これからやること
<<<<<<< HEAD
  #まず、文字コードはなんですか？
  
  #指定のファイルを読む
  
  #特定のパターンがあるか調査
  #そのデータの中に
  
=======
  #指定のファイルを読む
  #特定のパターンがあるか調査

>>>>>>> 0861fb7e0a68f4546b01f45b958815064d9a2bef
  #E-MAILアドレスある？

  #電話番号ある？

  #郵便番号ある？

  #LINKある？

  #日付ある？

  #タグある？

  #予約キーワードある？

  #時刻ある？

  #日程ある？

  #お金（日本円数字)ある？
<<<<<<< HEAD
  #通貨の単位と数字はなあに？ユーロ？
=======
  
end
>>>>>>> 0861fb7e0a68f4546b01f45b958815064d9a2bef
